app/views/creatives/_contact.html.erb

              <hr class="light">
                  <p class="text-faded"><%= Creative.find(1).justificacion rescue nil%></p>
---
SELECT  "creatives".* FROM "creatives" WHERE "creatives"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]