app/views/creatives/_header.html.erb

            <hr>
            <p><%= Creative.find(1).inicio rescue nil%></p>
---
SELECT  "creatives".* FROM "creatives" WHERE "creatives"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]