app/views/creatives/_services.html.erb

                    <h3>Consumo</h3>
                    <p class="text-muted"><%= Creative.find(1).consumo rescue nil%></p>
---
SELECT  "creatives".* FROM "creatives" WHERE "creatives"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]