app/controllers/creatives_controller.rb

SELECT  "creatives".* FROM "creatives" WHERE "creatives"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@creative = Creative.find(params[:id])

INSERT INTO "creatives" ("publicidad", "created_at", "updated_at") VALUES (?, ?, ?)  [["publicidad", "gola"], ["created_at", "2017-07-25 03:39:48.063959"], ["updated_at", "2017-07-25 03:39:48.063959"]]
---
  def create
    @creative = Creative.new(creative_params)

    respond_to do |format|
      if @creative.save

UPDATE "creatives" SET "consumo" = ?, "publicidad" = ?, "creacion" = ?, "ahorro" = ?, "justificacion" = ?, "inicio" = ?, "updated_at" = ? WHERE "creatives"."id" = ?  [["consumo", "gola"], ["publicidad", ""], ["creacion", ""], ["ahorro", ""], ["justificacion", ""], ["inicio", ""], ["updated_at", "2017-07-25 03:47:43.645217"], ["id", 1]]
---
  def update
      if @creative.update(creative_params)

SELECT  "creatives".* FROM "creatives" WHERE "creatives"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_creative
      @creative = Creative.find(params[:id])